# A0144915A
###### UserGuide.md
``` md
#### Visual Walkthrough

<img src="images/userGuide/mainWindow.png">

1. **To-do Panel** - shows to-dos.
2. **Deadline Panel** - shows deadlines.
3. **Event Panel** - shows events.
4. **Result Panel** - shows reminders, help page and search results.
5. **Command Box** - where you enter the command.

*The list of deadlines, events and reminders are always ordered according to their urgency.*

```
###### UserGuide.md
``` md
## Supported Time Formats

| Format               | Example                |
|----------------------|------------------------|
| dd MMMM yyyy hh.mma  | 01 Jan 2016 5.50pm     |
| yyyy-MM-dd hh.mma    | 2016-10-16 5.50pm      |
| today 5.50pm         | today 5.50pm           |
| tomorrow 5.50pm      | tommorrow 5.50pm       |


```
###### UserGuide.md
``` md
#### Finding Freetime

##### *Freetime*

Sometimes we might need to know when we are free. The `freetime` command shows you all the time slots that are not occupied by events.

*Format:*

`freetime [st/START_TIME] et/END_TIME`

*Examples:*

```
Explanation: Finding all free time slots from tomorrow 3.00pm to tomorrow 10.00pm.
> freetime st/tomorrow 3.00pm et/tomorrow 10.00pm

Explanation: Finding all free time slots from now to tomorrow 9.00pm.
> freetime et/tomorrow 9.00pm
```

<img src="images/userGuide/freetime.png">

```
###### UserGuide.md
``` md
#### Making Aliases for Commands

##### *Alias*

Ever felt that the command `tomorrow` is too long to type? Or if you have a better name for a command? Well, the `alias` command allows you to create aliases for commands. A command can have multiple aliases, but no two commands can have the same alias. Furthermore, an alias has to be a single word consisting of only letters and numbers.

*Format:*

`alias COMMAND_NAME NEW_NAME`

*Example:*

```
Explanation: Adding an alias for tomorrow.
> alias tomorrow tmr

Explanation: Listing all incomplete tasks and reminders for the next day.
> tmr

Explanation: Original command tomorrow will still work.
> tomorrow
```

##### *Unalias*

After setting an alias for a command, you can remove it with the `unalias` command. Note that you cannot remove the original command word.

*Format:*

`unalias ALIAS`

```
Explanation: Removing alias tmr from tomorrow
> unalias tmr
```

#### Saving and Loading Storage File

##### *Save*

You might want to store the schedule file in a separate folder. You can do so by specifying the full path location.

*Format:*

`save NEW_PATH`

*Example*

```
Explanation: Saving the schedule file to the Downloads folder.
> save C:\Users\Jim\Downloads\MySchedule.xml
```

##### *Load*

Similarly, you can load a schedule file from another folder by specifying the full path location.

*Format:*

`load PATH`

*Example*

```
Explanation: Loading a schedule file from the Documents folder.
> load C:\Users\Jim\Documents\.Schedule.xml
```

```
